# HasExtrusionDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..HasExtrusionDirection Property
IFCExtrusionCreationData Class See Also
---
Identifies if the data contains a extrusion direction.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool HasExtrusionDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasExtrusionDirection As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasExtrusionDirection {
	bool get ();
}
```

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace